[
   {
      "review_id": 1,
      "review_name": "David Fisher",
      "rating": "4.2/5",
      "time": "July 15, 2020",
      "review_content": "Had to get a new one because our other laptop finally died after 7 years. Didn’t want to spend a lot of money and would mostly be using it for just browsing the web, Zoom meetings, watching YouTube videos and mild gaming. So far it runs perfectly and smoothly. Must switch it out of S mode to get Zoom installed"
   },
   {
      "review_id": 2,
      "review_name": "Sadia Parker",
      "rating": "1/5",
      "time": "June 25, 2019",
      "review_content": "Complete waste of money. I’ve had it for a while and I barely use it and it’s literally impossible to accomplish anything because it’s so slow. Just get a tablet for the same price or spend a little extra for a functioning laptop."
   },
   {
      "review_id": 3,
      "review_name": "Shannon Gallagher",
      "rating": "2/5",
      "time": "June 10, 2020",
      "review_content": "I always bought acer this one wasn't as good as the old one. very disappointed"
   },
   {
      "review_id": 4,
      "review_name": "LGB",
      "rating": "3/5",
      "time": "April 25, 2019",
      "review_content": "I was surprised to see that the SDD drive was 118 GB instead of the 128 GB that was in the product description. I'm truly disappointed."
   },
   {
      "review_id": 5,
      "review_name": "Peter CS",
      "rating": "2.5/5",
      "time": "March 02, 2019",
      "review_content": "This looks to be a good laptop at a good price, but be aware that it does not have a UK keyboard. This means you can't type certain characters, including the pound sign £, and other characters are not where you expect them - for example the @ sign is shift-2 instead of being to the right of L."
   },
   {
      "review_id": 6,
      "review_name": "Casper",
      "rating": "2/5",
      "time": "August 01, 2019",
      "review_content": "There now seems to be a problem with the keyboard, the number 2 key will not change to a @ which means I cannot type in any email addresses. This means most programs I use require an email address I can't use right now. I have spoken to a few pc experts who gave me advice to update drivers deinstall - reinstall, which all worked. But didn't fix the problem. They have told me to get it replaced. I am waiting on the company to get back to me. Very disappointed, have wasted so much time trying to sort this. "
   },
   {
      "review_id": 7,
      "review_name": "viking Piper",
      "rating": "3/5",
      "time": "January 21, 2019",
      "review_content": "BUYER BE AWARE: This computer has Microsoft 10S. This is scam software by Microsoft to force you to use only Microsoft apps from their deserted island wasteland of an app store. The computer will not allow you to do anything else. You can upgrade to a full version of Microsoft 10... for another $134. Hard pass. STAY AWAY from ALL computers with Microsoft 10S!! Absolute garbage software."
   }
]