import React from 'react';

const Blog = () => {
   return (
      <div className='blog__section py-5'>
         <div className="container">
            <div className="row">
               <div className="col-12">
                  <article className='py-2'>
                     <strong>Qn-1. What is context api ?</strong>
                     <p>
                        আমরা রিঅ্যাক্ট এ সাধারণত একটা কম্পোনেন্ট থেকে আরেকটা কম্পোনেন্ট এ ডাটা সেন্ড করি।
                        সেক্ষেত্রে একটা কম্পোনেন্ট এর ডাটা আরেকটা চাইল্ড কম্পোনেন্ট এ প্রপস হিসাবে পাঠাতে হয়।
                        অনেক সময় অনেক গভীর এ ডাটা পাঠানো দরকার হয় তখন সেটাকে আমরা প্রপ্স ড্রিলিং বলে থাকি।
                        তাই এই কাজ টাই সহজ করার জন্যে রিয়াক্ট ওয়ালারা (Context Api) হুক্স তৈরি করে।
                        যেটির সাহায্যে একটি নির্দিষ্ট জায়গায় বা কম্পোনেন্ট এ (Context Provider) এর দ্বারা ডাটা ছড়িয়ে দেয়া হয় এবং সেই কম্পোনেন্ট এর আওতায়
                        যতগুলো চাইল্ড কম্পোনেন্ট থাকবে তারা (useContext) ব্যবহার করে সেই ডাটা গ্রহণ করতে পারে।
                        এটি সাধারণত সাইটের থিম টগল, ভাষা টগল ইত্যাদি ক্ষেত্রে ব্যবহার করা হয়ে থাকে।
                     </p>
                  </article>
               </div>
               <div className="col-12">
                  <article className='py-2'>
                     <strong>Qn-2. What is Semantic tag ?</strong>
                     <p>
                        এইচটি এম এল এর সিমান্টিক ট্যাগ হল যে ট্যাগ গুলোর কোন মিনিং আছে।
                        এই সিমান্টিক ট্যাগ গুলো ওয়েবসাইটের এক্সেসব্লিটি বাড়ায় দেয়।
                        ওয়েবপেজ এর (SEO) করার জন্যে এই ট্যাগ গুলো খুবই গুরুত্বপূর্ণ।
                        তারমধ্যে এই ট্যাগ গুলো হল (article, strong, details, aside, nav, form, header, footer, section, main) ইত্যাদি।
                        header, footer এবং article-এর মতো ট্যাগ গুলোর সবকটি মিনিংফুল বলে মনে করা হয় কারণ তারা তাদের উদ্দেশ্য এবং তাদের ভিতরে থাকা বিষয়বস্তুর ধরণকে সঠিকভাবে বর্ণনা করে।
                     </p>
                  </article>
               </div>
               <div className="col-12">
                  <article className='py-2'>
                     <strong>Qn-3. Inline-block vs inline vs block element ?</strong>
                     <p>
                        ইনলাইন ইলিমেন্ট:
                        বাম এবং ডান মার্জিন এবং প্যাডিংকে গ্রহণ করে, তবে উপরে এবং নীচে নয়
                        এটির প্রস্থ এবং উচ্চতার সেট থাকতে পারে না
                        অন্যান্য উপাদানগুলিকে তাদের বাম এবং ডানে বসার অনুমতি দেয়।
                        
                        <br></br>
                        ব্লক ইলিমেন্ট:
                        একটি ব্লক উপাদান সর্বদা একটি নতুন লাইনে শুরু হয় এবং ওয়েব পৃষ্ঠার বাম এবং ডানে অনুভূমিক স্থান পূরণ করে।
                        যেকোনো ব্লক উপাদানের চার দিকে মার্জিন এবং প্যাডিং যোগ করা যায় — উপরে, ডান, বাম এবং নীচে।

                        <br></br>
                        ইনলাইন-ব্লক:
                        এই ইলিমেন্ট ইনলাইন ইলিমেন্টের অনুরূপ, তাদের চার দিকে প্যাডিং এবং মার্জিন যোগ করা যায়।
                        এবং এটির জন্যে সি এস এস এ ইনলাইন-ব্লক লিখতে হয়।
                     </p>
                  </article>
               </div>
            </div>
         </div>
      </div>
   );
};

export default Blog;